sentence([('@','REP'), ('RooryG','USERN'), ('ت','TNS1'), ('سلم','VB'), ('ي','PRP'), ('يا','RP'), ('قلب','NN'), ('ي','PRP')]).

sentence([('شئ','NN'), ('من','IN'), ('ال','DET'), ('إنسانية','NN'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('أن','IN'), ('ت','TNS1'), ('حاول','VB'), ('أن','IN'), ('ت','TNS1'), ('حقق','VB'), ('شيئاً','NN'), ('من','IN'), ('إنسانيت','NN'), ('ك','PRP'), ('التي','WP'), ('ت','TNS1'), ('خص','VB'), ('ال','DET'), ('غير','NN'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('حين','NN'), ('ما','PRP'), ('تكون','VB'), ('صديقاً','NN'), ('جيداً','JJ'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('♡','EMOJ'), ('•','EMOJ'), ('•','EMOJ'), ('http://t.co/inRKySur2Q','LINK')]).

sentence([('مفيش','VB'), ('احلي','JJ'), ('من','IN'), ('احساس','NN'), ('ان','IN'), ('ك','PRP'), ('ت','TNS1'), ('بقا','VB'), ('برة','NN'), ('مصر','NNP'), ('بجد','NN'), ('^^','EMOT')]).

sentence([('@','REP'), ('alabbas75','USERN'), ('@','MEN'), ('DrA_Farouk235','USERN'), ('هذا','DT'), ('حق','NN'), ('و','CC'), ('نحن','PRP'), ('ب','IN'), ('حمد','NN'), ('الله','NNP'), ('ك','PRP'), ('مصر','JJ'), ('ين','AGR'), ('ن','TNS1'), ('حب','VB'), ('الله','NNP'), ('و','CC'), ('رسول','NN'), ('ه','PRP'), ('محمد','NNP'), ('و','CC'), ('كل','NN'), ('نبياء','NN'), ('و','CC'), ('ال','DET'), ('رسل','NN'), ('و','CC'), ('نتاجر','VB'), ('مع','IN'), ('الله','NNP'), ('و','CC'), ('لعن','VB'), ('الله','NNP'), ('خوارج','NN'), ('ال','DET'), ('عصر','NN')]).

sentence([('@','REP'), ('NI_AF2013','USERN'), ('هلاء','NN')]).

sentence([('إذا','IN'), ('طفرت','VB'), ('ك','PRP'), ('ي','TNS1'), ('عني','VB'), ('أحب','VB'), ('ك','PRP'), ('غير','RP'), ('جذي','DT'), ('انسى','VB'), ('كل','NN'), ('الي','WP'), ('احب','VB'), ('هم','PRP'), ('اطفر','VB'), ('هم','PRP'), (':','PUNC'), (':','PUNC')]).

sentence([('@','REP'), ('BernardShawQ8','USERN'), ('ما','WP'), ('في','IN'), ('ها','PRP'), ('شي','NN'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('يمكن','VB'), ('مو','RP'), ('ناسي','JJ'), ('فضل','NN'), ('هم','PRP'), ('علي','IN'), ('ه','PRP'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('حليب','NN'), ('و','CC'), ('سيريلاك','NN'), ('!','PUNC'), ('!','PUNC')]).

sentence([('او','CC'), ('متنى','NN')]).

sentence([('من','IN'), ('دواعي','NN'), ('سرور','JJ'), ('ي','PRP'), ('حضور','VB'), ('ي','PRP'), ('ل','IN'), ('حفلت','NN'), ('كم','PRP'), ('ال','DET'), ('مقام','NN'), ('ه','PRP'), ('ب','IN'), ('ال','DET'), ('أمس','NN'), ('على','IN'), ('شرف','NN'), ('الزبالي','NNP'), ('و','CC'), ('التي','WP'), ('أقيم','VB'), ('ت','PRP'), ('برقي','JJ'), ('و','CC'), ('مكانة','NN'), ('شخص','NN'), ('كم','PRP'), ('ال','DET'), ('كريم','JJ')]).

sentence([('فرع','NN'), ('مطعم','NN'), ('البيك','NNP'), ('ال','DET'), ('جديد','JJ'), ('في','IN'), ('بريدة','NNP'), ('http://t.co/m1BG2yVNMc','LINK')]).

sentence([('وع','IN'), ('كل','NN'), ('شي','NN'), ('جميل','JJ'), ('ف','IN'), ('حيات','NN'), ('ي','PRP'), ('-','PUNC'), ('AlHmdllh','NN'), ('-','PUNC')]).

sentence([('ليش','WRB'), ('ب','IN'), ('ال','DET'), ('إكسبلور','NNP'), ('هذا','DT'), ('ال','DET'), ('زفت','JJ'), ('حبيب','NN'), ('ه','PRP'), ('في','IN'), ('ه','PRP'), ('جين','NN'), ('ات','AGR'), ('كلب','NN'), ('http://t.co/R84qqIPQQN','LINK')]).

sentence([('س','FUT'), ('يأت','VB'), ('ي','PRP'), ('رمضان','NNP'), ('بدون','NN'), ('أب','NN'), ('ي','PRP'), ('و','CC'), ('س','FUT'), ('ت','TNS1'), ('ظل','VB'), ('ال','DET'), ('ذكري','NN'), ('ات','AGR'), ('ت','TNS1'), ('دور','VB'), ('في','IN'), ('مخيلت','NN'), ('ي','PRP'), ('لازلت','VB'), ('اتمنى','VB'), ('أن','IN'), ('ي','TNS1'), ('عود','VB'), ('و','CC'), ('لازلت','VB'), ('اشتاق','VB'), ('له','PRP'), ('و','CC'), ('افتقد','VB'), ('ه','PRP'), ('ب','IN'), ('شده','NN'), ('.','PUNC'), ('.','PUNC'), ('-','PUNC'), ('فردوس','NN'), ('ك','PRP'), ('لمن','IN'), ('سبق','VB'), ('ونا','AGR'), ('يا','RP'), ('الله','NNP'), ('♥','EMOJ')]).

sentence([('كان','VB'), ('ت','PRP'), ('قويّ','JJ'), ('ه','PRP'), ('لكن','RP'), ('هزم','VB'), ('ها','PRP'), ('حزن','NN'), ('ها','PRP'), ('،','PUNC'), ('قويّ','JJ'), ('ه','PRP'), ('لكن','RP'), ('ها','PRP'), ('بك','VB'), ('ت','PRP'), ('.','PUNC')]).

sentence([('@','REP'), ('MahyMur','USERN'), ('يا','RP'), ('بختك','NN')]).

sentence([('@','REP'), ('AliAlaN_','USERN'), ('من','IN'), ('قلب','NN'), ('ال','DET'), ('حدث','NN')]).

sentence([('أعتذر','VB'), ('ل','IN'), ('كل','NN'), ('جني','NN'), ('شآف','VB'), ('حركات','NN'), ('ي','PRP'), ('ل','IN'), ('حال','JJ'), ('ي','PRP'), ('@','REP'), ('Yasser3k','USERN'), ('ملبوس','JJ'), ('ال','DET'), ('عافيه','JJ'), ('❤','EMOJ'), ('️','EMOJ')]).

sentence([('@','REP'), ('ahmedlatif76','USERN'), ('MeshalAldahaini','NNP'), ('ههههههه','UH'), ('بس','NN'), ('ده','DT'), ('ال','DET'), ('عنوان','NN'), ('ت','TNS1'), ('غير','VB'), ('يا','RP'), ('ريس','NN'), ('اصبح','VB'), ('علي','IN'), ('شارع','NN'), ('الخليج','NNP'), ('معلش','NN'), ('ال','DET'), ('بيوت','NN'), ('اسرار','NN')]).

sentence([('@','REP'), ('knooz_alma3rfa','USERN'), ('الله','NNP'), ('أمر','VB'), ('ك','PRP'), ('ب','IN'), ('أن','IN'), ('ت','TNS1'), ('عبدي','VB'), ('ه','PRP'), ('و','CC'), ('ت','TNS1'), ('فعل','VB'), ('ي','PRP'), ('ال','DET'), ('خير','NN'), ('ل','IN'), ('لناس','NN'), ('ي','TNS1'), ('كلف','VB'), ('ك','PRP'), ('ب','IN'), ('ال','DET'), ('بحث','NN'), ('عن','IN'), ('ما','PR'), ('ي','TNS1'), ('فعل','VB'), ('ه','PRP'), ('ال','DET'), ('ناس','NN'), ('وش','WRB'), ('دخلن','VB'), ('ي','PRP'), ('ب','IN'), ('ما','WP'), ('ي','TNS1'), ('فعل','VB'), ('ه','PRP'), ('داعش','NNP'), ('و','CC'), ('ال','DET'), ('إرهابيين','NN'), ('ون','AGR'), ('عقل','NN'), ('ك','PRP')]).

sentence([('@','REP'), ('3ajel_news','USERN'), ('ال','DET'), ('سلام','NN'), ('علي','IN'), ('كم','PRP'), ('ان','IN'), ('ت','PRP'), ('ال','DET'), ('طموح','JJ'), ('ان','IN'), ('كان','VB'), ('باقي','NN'), ('بي','IN'), ('طموح','NN'), ('،','PUNC'), ('و','CC'), ('انت','PRP'), ('ال','DET'), ('سبب','NN'), ('لو','IN'), ('كان','VB'), ('مكتوب','JJ'), ('لي','IN'), ('فرح','NN')]).

sentence([('فيصل','NNP'), ('القاسم','NNP'), (':','PUNC'), ('ت','TNS1'), ('وقف','VB'), ('عملي','NN'), ('ات','AGR'), ('ال','DET'), ('نظام','NN'), ('ال','DET'), ('سوري','NNP'), ('ب','IN'), ('نسبة','NN'), ('80','CD'), ('%','PUNC'), ('بسبب','NN'), ('انسحاب','VB'), ('ال','DEt'), ('ميليشي','NN'), ('ات','AGR'), ('ال','DET'), ('شيعي','JJ'), ('ة','PRP'), ('إلى','IN'), ('العراق','NNP'), ('.','PUNC'), ('سوريا','NNP')]).

sentence([('"','PUNC'), ('@','RET'), ('jii5x:','USERN'), ('قبل','IN'), ('ما','WP'), ('ت','TNS1'), ('شوف','VB'), ('وش','WRB'), ('ناقص','VB'), ('ك','PRP'), ('شوف','VB'), ('وش','WRB'), ('الله','NNP'), ('عطا','VB'), ('ك','PRP'), ('.','PUNC'), ('"','PUNC')]).

sentence([('@','REP'), ('MjnonetHaifa89','USERN'), ('KarimaWehbe','NNP'), ('@','PUNC'), ('Haifaholics','NNP'), ('@','PUNC'), ('HaifaWehbe','NNP'), ('لا','RP'), ('انا','PRP'), ('حنام','VB'), ('شويه','JJ'), ('بس','NN'), ('شوف','VB'), ('ي','PRP'), ('كم','WRB'), ('توقيت','NN'), ('عمل','VB'), ('ت','PRP'), ('http://t.co/CsCAQgK1b4','LINK')]).

sentence([('@','REP'), ('header_hfc','USERN'), ('طيب','JJ'), ('تابع','VB'), ('ني','PRP'), ('☺','EMOJ'), ('~','EMOJ'), ('️','EMOJ')]).

sentence([('@','REP'), ('alreqeb_h','USERN'), ('لا','RP'), ('تتردد','VB'), ('في','IN'), ('ال','DET'), ('عودة','NN'), ('إلى','IN'), ('الله','NNP'), ('مهما','WP'), ('لوث','VB'), ('ت','TNS2'), ('ك','PRP'), ('ال','DET'), ('خطايا','NN'), ('و','CC'), ('ال','DET'), ('ذنوب','NN'), ('،','PUNC'), ('ف','IN'), ('الذي','WP'), ('ستر','VB'), ('ك','PRP'), ('و','CC'), ('أنت','PRP'), ('تحت','IN'), ('سقف','NN'), ('ال','DET'), ('معصية','NN'), ('لن','RP'), ('ي','TNS1'), ('فضح','VB'), ('ك','PRP'), ('و','CC'), ('أنت','PRP'), ('تحت','IN'), ('جناح','NN'), ('ال','DET'), ('توبة','NN'), ('!','PUNC')]).

sentence([('ثانوية','NN'), ('عامة','JJ'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('انا','PRP'), ('فاكر','VB'), ('انى','PRP'), ('كنت','VB'), ('ب','IN'), ('دخل','VB'), ('و','CC'), ('اخرج','VB'), ('من','IN'), ('غير','RP'), ('ما','WP'), ('اقول','VB'), ('ال','DET'), ('امتحان','NN'), ('سهل','JJ'), ('او','CC'), ('صعب','JJ'), ('الى','IN'), ('اعرف','VB'), ('ه','PRP'), ('زاكر','VB'), ('و','CC'), ('هتحل','VB'), ('ما','WP'), ('مش','VB'), ('زم','NN'), ('تكون','VB'), ('ال','DET'), ('رياضه','NN'), ('محفوظ','NN'), ('ه','PRP'), ('$$$$','NN')]).

sentence([('أفضل','JJ'), ('تعليق','NN'), ('ل','IN'), ('هذه','DT'), ('ال','DET'), ('صورة','NN'), ('؟','PUNC'), ('؟','PUNC'), ('http://t.co/pAass27dG9','LINK')]).

sentence([('تتت','TNS1'), ('قهوي','VB'), ('ت','TNS2'), ('كـ','PRP'), ('سنين','NN'), ('.','PUNC'), ('.','PUNC'), ('و','CC'), ('لا','RP'), ('نويتـ','VB'), ('أهـزّ','VB'), ('فنجاليعليكـ','NN'), ('الله','NNP'), ('و','CC'), ('أمانه','NN'), ('لا','RP'), ('ت','TNS1'), ('جيبـ','VB'), ('(','PUNC'), ('ال','DET'), ('عيد','NNP'), (')','PUNC'), ('و','CC'), ('أهـزّ','VB'), ('ه','PRP'), ('.','PUNC'), ('.','PUNC'), ('!','PUNC')]).

sentence([('ال','DET'), ('سسسسلام','NN'), ('علي','IN'), ('كم','PRP')]).

sentence([('@','REP'), ('Fatoum22','USERN'), ('علمي','JJ')]).

sentence([('اذا','IN'), ('مات','VB'), ('ال','DET'), ('حياءُ','NN'), ('ب','IN'), ('قلب','NN'), ('أنثىفَ','NN'), ('تباً','NN'), ('ثم','CC'), ('تباً','NN'), ('ل','IN'), ('جمالِ','NN'), ('و','CC'), ('ان','IN'), ('عاش','VB'), ('ال','DET'), ('فتى','NN'), ('ل','IN'), ('عرض','NN'), ('ذئبٌفَ','NN'), ('عار','JJ'), ('ان','IN'), ('يعدّ','VB'), ('من','IN'), ('ال','DET'), ('رجال','NN')]).

sentence([('@','REP'), ('mmhonh99','USERN'), ('rere8988','NNP'), ('مون','VB'), ('و','CC'), ('ين','VB'), ('تييح','VB'), ('لو','IN')]).

sentence([('رمضان','NNP'), ('اقترب','VB'), ('يا','PR'), ('فرحت','NN'), ('ي','PRP'), ('❤','EMOJ'), ('❤','EMOJ'), ('.','PUNC')]).

sentence([('أنا','PRP'), ('قلب','NN'), ('ي','PRP'), ('إلي','IN'), ('ك','PRP'), ('ميّال','JJ'), ('،','PUNC'), ('و','CC'), ('مفيش','RP'), ('غير','NN'), ('ك','PRP'), ('ع','IN'), ('ال','DET'), ('بال','NN'), ('❤','EMOJ'), ('️','EMOJ')]).

sentence([('انيستا','NNP'), (':','PUNC'), ('صعوبة','JJ'), ('ال','DET'), ('موقف','NN'), ('بعد','IN'), ('ال','DET'), ('خروج','NN'), ('من','IN'), ('ال','DET'), ('بطولة','NN'), ('؟','PUNC'), ('قاسية','JJ'), ('ل','IN'), ('غاية','NN'), ('في','IN'), ('ال','DET'), ('وقت','NN'), ('ال','DET'), ('راهن','JJ'), ('،','PUNC'), ('الان','NN'), ('نحن','PRP'), ('نمر','VB'), ('ب','IN'), ('وقت','NN'), ('صعب','JJ'), ('ل','IN'), ('غاية','NN'), ('.','PUNC'), ('http://t.co/ghbYrlPbEH','LINK')]).

sentence([('@','REP'), ('moshaks1111','USERN'), ('اكثر','JJ'), ('ما','PR'), ('ي','TNS1'), ('خرب','VB'), ('على','IN'), ('ال','DET'), ('سوق','NN'), ('صغار','JJ'), ('ال','DET'), ('مستثمر','NN'), ('ين','AGR')]).

sentence([('عادة','JJ'), ('الأيام','NN'), ('تاخذ','VB'), ('ماتجيب','VB'), ('!','PUNC')]).

sentence([('@','REP'), ('_hmoud','USERN'), ('ههههههههههههههه','UH'), ('يا','RP'), ('فيصل','NNP'), ('القاااسم','NNP'), ('شجع','VB'), ('ايران','NNP'), ('ال','DET'), ('سنة','NN'), ('هاي','NN'), ('طيب','JJ'), ('ههههههههه','UH')]).

sentence([('اطلع','VB'), ('من','IN'), ('ال','DET'), ('امتحان','NN'), ('مزفتة','JJ'), ('و','CC'), ('يطلع','VB'), ('داك','DT'), ('ال','DET'), ('دافور','JJ'), ('يقول','VB'), ('ال','DET'), ('امتحان','NN'), ('كان','VB'), ('زيييت','JJ'), ('هل','WRB'), ('جرب','VB'), ('ت','PRP'), ('بعضا','NN'), ('من','IN'), ('ال','DET'), ('كف','NN')]).

sentence([('@','REP'), ('FAmeeen','USERN'), ('بنات','NN'), ('مسائ','JJ'), ('ي','PRP'), ('ال','DET'), ('يوم','NN'), ('ال','DET'), ('صبح','NN')]).

sentence([('أنـت','PRP'), ('من','IN'), ('عـلّـق','VB'), ('حـيـات','NN'), ('ي','PRP'), ('و','CC'), ('اخــتــفـالا','NN'), ('قـطـع','VB'), ('حـلـم','NN'), ('ي','PRP'), ('.','PUNC'), ('.','PUNC'), ('و','CC'), ('لا','RP'), ('جـاب','VB'), ('ال','DET'), ('ـطـموح','NN')]).

sentence([('@','REP'), ('IMpqm','USERN'), ('Sexya','NNP'), ('69','CD'), ('هلا','NN')]).

sentence([('عاجل','JJ'), (':','PUNC'), ('رافايل','NNP'), ('بينيتز','NNP'), ('هو','PRP'), ('من','IN'), ('س','FUT'), ('ي','TNS1'), ('خلف','VB'), ('ديل','NNP'), ('بوسكي','NNP'), ('في','IN'), ('ال','DET'), ('منتخب','NN'), ('ال','DET'), ('اسباني','JJ'), ('!','PUNC')]).

sentence([('اتق','VB'), ('شر','NN'), ('من','IN'), ('فضفض','VB'), ('ت','PRP'), ('إلي','IN'), ('ه','PRP'), ('ننوعي','NN'), ('ات','AGR'), ('ام','NN'), ('زكي','NNP'), ('كثيرة','JJ'), ('هذه','DT'), ('ال','DET'), ('اياام','NN'), ('@','REP'), ('rthaill','USERN')]).

sentence([('@','REP'), ('LawSociety_UOB','USERN'), ('متى','WRB'), ('ت','TNS1'), ('نزل','VB'), ('ال','DET'), ('علام','NN'), ('ات','AGR'), ('في','IN'), ('ال','DET'), ('موقع','NN')]).

sentence([('اللهم','NN'), ('لك','PRP'), ('ال','DET'), ('حمد','NN'), ('حتى','IN'), ('،','PUNC'), ('ت','TNS1'), ('رضا','VB')]).

sentence([('@','REP'), ('Moon1234f','USERN'), (':','PUNC'), ('ftooomm14211','NNP'), (':','PUNC'), ('يا','PR'), ('رب','NN'), ('ال','DET'), ('جنه','NNP'), ('ال','DET'), ('بارد','JJ'), ('ه','PRP'), ('ل','IN'), ('ناس','NN'), ('الى','IN'), ('بمجرد','NN'), ('م','WP'), ('ن','TNS1'), ('سمع','VB'), ('ب','IN'), ('أسمائ','NN'), ('هم','PRP'), ('ن','TNS1'), ('بتسم','VB'), ('.','PUNC')]).

sentence([('في','IN'), ('ال','DET'), ('قبور','NN'), ('أشخاصٌ','NN'), ('ت','TNS1'), ('قطع','VB'), ('ت','PRP'), ('قلوب','NN'), ('نا','PRP'), ('ل','IN'), ('فرآق','NN'), ('هم','PRP'), ('و','CC'), ('ت','TNS1'), ('زيد','VB'), ('ال','DET'), ('مشآعر','NN'), ('اشتياقاً','JJ'), ('لهم','PRP'), ('في','IN'), ('كل','NN'), ('لحظة','NN'), ('ربي','NN'), ('ارحم','VB'), ('هم','PRP'), ('و','CC'), ('نور','VB'), ('هم','PRP'), ('قبور','NN'), ('و','CC'), ('وسع','VB'), ('مدخل','NN'), ('هم','PRP'), ('و','CC'), ('اجعل','VB'), ('ال','DET'), ('جنة','NN'), ('مقر','NN'), ('هم','PRP'), ('و','CC'), ('مثوا','NN'), ('هم','PRP')]).

sentence([('@','REP'), ('cvv13605','USERN'), ('MrMajed10','NNP'), ('الله','NNP'), ('ي','TNS1'), ('شافي','VB'), ('ها','PRP'), ('يا','PRP'), ('قادر','JJ'), ('يأ','PR'), ('كريم','VB')]).

sentence([('@','REP'), ('sooos_mohammed','USERN'), ('هاااي','NN'), ('سارا','NNP')]).

sentence([('@','REP'), ('11_HMADA','USERN'), ('مساء','NN'), ('ال','DET'), ('خير','NN'), ('كم','PRP'), ('ت','TNS1'), ('ظليل','VB'), ('ال','DET'), ('سيارة','NN'), ('ال','DET'), ('صغيرة','JJ')]).

sentence([('ال','DET'), ('كلام','NN'), ('؟','PUNC'), ('كلن','NN'), ('يقول','VB'), ('ه','PRP')]).

sentence([('@','REP'), ('Salmaal7ajry','USERN'), ('صدقت','NN'), ('ي','PRP'), ('اخت','NN'), ('ي','PRP')]).

sentence([('ت','TNS1'), ('أخذ','VB'), ('قرار','NN'), ('وقت','NN'), ('زعل','JJ'), ('قد','RP'), ('ت','TNS1'), ('ندم','VB'), ('كثيرا','JJ'), ('.','PUNC')]).

sentence([('لو','IN'), ('كثروا','VB'), ('عشاق','NN'), ('ه','PRP'), ('؟','PUNC'), ('ي','PRP'), ('ظل','VB'), ('محبوب','JJ'), ('ي','PRP'), ('ل','IN'), ('وحدي','NN'), ('.','PUNC')]).

sentence([('ي','TNS1'), ('قول','VB'), ('نجيب','NNP'), ('محفوظ','NNP'), (':','PUNC'), ('لا','RP'), ('ت','TNS1'), ('خبرون','VB'), ('ي','PRP'), ('عن','IN'), ('من','IN'), ('ي','TNS1'), ('كره','VB'), ('ني','PRP'), ('أو','CC'), ('ي','TNS1'), ('تكلم','VB'), ('عني','IN'), ('.','PUNC'), ('.','PUNC'), ('اترك','VB'), ('و','AGR'), ('ني','PRP'), ('أحب','VB'), ('ال','DET'), ('جميع','NN'), ('و','CC'), ('أظن','VB'), ('أن','IN'), ('ال','DET'), ('جميع','NN'), ('ي','TNS1'), ('حب','VB'), ('ني','PRP')]).

sentence([('أجمل','JJ'), ('حديث','NN'), (':','PUNC'), ('هو','PRP'), ('الذي','WP'), ('لم','RP'), ('ن','TNS1'), ('شعر','VB'), ('أنه','IN'), ('طويل','JJ'), ('إلا','RP'), ('بعد','IN'), ('ال','DET'), ('نظر','NN'), ('إلى','IN'), ('ال','DET'), ('وقت','NN'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('.','PUNC'), ('!','PUNC'), ('!','PUNC'), ('prt','NN'), ('جيب','VB'), ('وا','AGR'), ('كامبل','NNP'), ('جيب','VB'), ('وووو','AGR'), ('ه','PRP')]).

sentence([('ايه','NN'), ('ال','DET'), ('هنا','NN'), ('اللى','WP'), ('انا','PRP'), ('في','IN'), ('.','PUNC'), ('.','PUNC'), ('ال','DET'), ('مكلف','JJ'), ('رابطة','NN'), ('ال','DET'), ('مكينة','NN'), ('ال','DET'), ('ألمانية','JJ'), ('متكى','JJ'), ('عند','NN'), ('ي','PRP'), ('في','IN'), ('ال','DET'), ('بيت','NN'), ('امس','NN'), ('.','PUNC'), ('.','PUNC'), ('منور','JJ'), ('يا','RP'), ('سيد','NN'), ('ي','PRP'), ('.','PUNC'), ('.','PUNC'), ('Cc','NN'), (':','PUNC'), ('@','REP'), ('Nawaf_AF','USERN'), ('http://t.co/WWoi4VBQiZ','LINK')]).

sentence([('لاعب','NN'), ('الخليج','NNP'), ('صالح','NNP'), ('البشير','NNP'), ('س','FUT'), ('ي','TNS1'), ('عود','VB'), ('ل','IN'), ('تمثيل','NN'), ('نادي','NN'), ('ال','DET'), ('إتفاق','NNP'), ('مجددا','NN'), ('في','IN'), ('دوري','NN'), ('ركاء','NNP'), ('بعد','IN'), ('أن','IN'), ('ت','TNS1'), ('وصل','VB'), ('لإتفاق','NN'), ('رسمي','JJ'), ('مع','IN'), ('إدارة','NN'), ('ال','DET'), ('نادي','NN'), ('.','PUNC')]).

sentence([('وين','WRB'), ('ال','DET'), ('حزن','NN'), ('و','CC'), ('ام','NN'), ('ي','PRP'), ('على','IN'), ('ال','DET'), ('قاع','NN'), ('ت','TNS1'), ('مشي','VB'), ('جعل','VB'), ('ي','PRP'), ('فدى','VB'), ('موطى','NN'), ('قدم','NN'), ('ها','PRP'), ('على','IN'), ('ال','DET'), ('قاعهي','NN'), ('اقرب','JJ'), ('ل','IN'), ('عين','NN'), ('ي','PRP'), ('من','IN'), ('حدود','NN'), ('رمش','NN'), ('ي','PRP'), ('و','CC'), ('اقرب','JJ'), ('من','IN'), ('انفاس','NN'), ('ي','PRP'), ('ل','IN'), ('جوف','NN'), ('ي','PRP'), ('و','CC'), ('ال','DET'), ('اضلاع','NN'), ('.','PUNC'), ('.','PUNC'), ('♡','EMOJ'), ('♡','EMOJ')]).

sentence([('@','REP'), ('Azooz19916','USERN'), ('مرحباااا','UH')]).

sentence([('يا','RP'), ('ناس','NN'), ('يا','RP'), ('عسل','NN'), ('فولو','VB'), ('باك','NN'), ('رمضان','NNP'), ('وصل','VB'), ('اللهم','NN'), ('بلغ','VB'), ('نا','PRP'), ('رمضان','NNP')]).

sentence([('مهما','WP'), ('اختف','VB'), ('ت','PRP'), ('من','IN'), ('حيات','NN'), ('ك','PRP'), ('أمور','NN'), ('ظن','VB'), ('ت','PRP'), ('أن','IN'), ('ها','PRP'), ('سبب','VB'), ('سعادت','NN'), ('ك','PRP'), ('تأكد','VB'), ('أن','IN'), ('الله','NNP'), ('صرف','VB'), ('ها','PRP'), ('عن','NN'), ('ك','PRP'), ('قبل','IN'), ('أن','IN'), ('تكون','VB'), ('سبباً','NN'), ('في','IN'), ('تعاست','NN'), ('ك','PRP')]).

sentence([('مَهمَآ','NN'), ('كَانتّ','VB'), ('نِيتُ','NN'), ('ك','PRP'), ('صَآفِيہْ','JJ'), ('فِي','IN'), ('أيُ','NN'), ('شَيءٍ','NN'), ('ت','TNS1'), ('فَعل','VB'), ('ہْ','PRP'), ('لنّ','RP'), ('تَ','TNS1'), ('نجُو','VB'), ('مِن','IN'), ('ظُنونَ','NN'), ('هم','PRP'), ('ال','DET'), ('سيّئَہْ','JJ'), ('أبداً','NN'), ('.','PUNC'), ('.','PUNC')]).

sentence([('بدأ','VB'), ('ال','DET'), ('قبول','NN'), ('ب','IN'), ('كلي','NN'), ('ات','AGR'), ('ال','DET'), ('راجحي','NNP'), ('شراك','NN'), ('ات','AGR'), ('عالمية','JJ'), ('.','PUNC'), ('منح','NN'), ('دراسية','JJ'), ('.','PUNC'), ('مكافآت','NN'), ('http://t.co/Lo2I9RFwvg','LINK'), ('http://t.co/vivWvYMxoK','LINK')]).

sentence([('الهم','NN'), ('و','CC'), ('ال','DET'), ('هوجاس','NN'), ('و','CC'), ('ال','DET'), ('حزن','NN'), ('و','CC'), ('ال','DET'), ('ضيق','NN'), ('لازم','VB'), ('تعرف','VB'), ('اسباب','NN'), ('ها','PRP'), ('في','IN'), ('حيات','NN'), ('ك','PRP'), ('و','CC'), ('ال','DET'), ('حظ','NN'), ('و','CC'), ('ال','DET'), ('فرحه','NN'), ('و','CC'), ('كثر','NN'), ('ال','DET'), ('توافيق','NN'), ('لاخفت','VB'), ('رب','NN'), ('ك','PRP'), ('و','CC'), ('انتظم','VB'), ('ت','PRP'), ('ب','IN'), ('صلات','NN'), ('ك','PRP')]).

sentence([('هذه','DT'), ('ضريبة','NN'), ('ال','DET'), ('مواقف','NN'), ('و','CC'), ('ال','DET'), ('ثبات','NN'), ('على','IN'), ('ال','DET'), ('مبدأ','NN'), ('ما','PR'), ('ي','TNS1'), ('حصل','VB'), ('مع','IN'), ('مسلم','NNP'), ('ال','DET'), ('براك','NNP'), ('امر','NN'), ('ي','TNS1'), ('جعل','VB'), ('نا','PRP'), ('ان','IN'), ('ن','TNS1'), ('قف','VB'), ('مع','IN'), ('هذا','DT'), ('ال','DET'), ('رجل','NN'), ('ال','DET'), ('حر','JJ'), ('فقد','VB'), ('ي','TNS1'), ('كفي','VB'), ('ه','PRP'), ('ان','IN'), ('ه','PRP'), ('ت','TNS1'), ('حمل','VB'), ('مسؤولي','NN'), ('ات','AGR'), ('ه','PRP'), ('اما','RP'), ('ال','DET'), ('شعب','NNP'), ('.','PUNC')]).

sentence([('و','CC'), ('يا','RP'), ('خجـلاه','NN'), ('من','IN'), ('قبح','VB'), ('اكتساب','JJ'), ('ي','PRP'), ('إذا','IN'), ('ما','WP'), ('أبدت','VB'), ('ال','DET'), ('صحـف','NN'), ('ال','DET'), ('عيوبا','NN'), ('و','CC'), ('يا',''), ('حـذراه','NN'), ('مـن','IN'), ('نـار','NN'), ('ت','TNS1'), ('لظى','VB'), ('إذا','IN'), ('زفـر','VB'), ('ت','PRP'), ('أقلقـ','VB'), ('ت','PRP'), ('ال','DET'), ('قلوبـا','NN')]).

sentence([('تم','VB'), ('صرف','VB'), ('ال','DET'), ('نظر','NN'), ('عن','IN'), ('سلمان','NNP'), ('هزازي','NNP'), ('أصلا','NN'), ('عادي','JJ'), ('القميزي','NNP'), ('جاي','VB'), ('من','IN'), ('إصابه','NN'), ('و','CC'), ('أفضل','NN'), ('منه','NN'), ('حاحا','UH')]).

sentence([('انا','PRP'), ('لما','WP'), ('ابي','VB'), ('اراضي','VB'), ('احد','NN'), ('ت','TNS1'), ('صير','VB'), ('هوشه','NN'), ('ثانيه','JJ'), ('مشاعر','NN'), ('معوقه','JJ'), ('قسم','NN'), ('ب','IN'), ('الله','NNP'), (':','PUNC'), (':','PUNC')]).

sentence([('لا','RP'), ('ت','TNS1'), ('سخر','VB'), ('و','CC'), ('لا','RP'), ('س','FUT'), ('ت','TNS1'), ('صغر','VB'), ('و','CC'), ('لا','RP'), ('ت','TNS1'), ('هزا','VB'), ('ب','IN'), ('ال','DET'), ('ناس','NN'), ('ف',''), ('لا','PR'), ('ت','TNS1'), ('علم','VB'), ('كيف','WRB'), ('س','FUT'), ('ي','TNS1'), ('كون','VB'), ('حال','NN'), ('ك','PRP'), ('غدا','NN'), ('.','PUNC')]).

sentence([('@','REP'), ('HarpyMuslim','USERN'), ('خلص','JJ'), ('ت','TNS1'), ('طلع','VB'), ('من','IN'), ('كل','NN'), ('ال','DET'), ('مونديال','NN')]).

sentence([('ما','PR'), ('قل','VB'), ('ت','PRP'), ('لك','DT'), ('لا','RP'), ('ت','TNS1'), ('دور','VB'), ('يا','RP'), ('غالي','NN'), ('صعب','JJ'), ('ت','TNS1'), ('لقى','VB'), ('بدال','JJ'), ('ي','PRP'), ('.','PUNC')]).

sentence([('@','RET'), ('AmaniAli2012:','USERN'), ('مين','WP'), ('ي','TNS1'), ('دخل','VB'), ('ة','PRP'), ('ب','IN'), ('قوة','JJ'), ('♡','EMOJ'), ('ريتويت','NN'), ('http://t.co/mFawGKD973','LINK')]).

sentence([('@','REP'), ('reema_q81','USERN'), ('يا','RP'), ('مرحبا','UH'), ('لا','RP'), ('جيت','VB'), ('نا','PRP'), ('حزة','NN'), ('عصير','NN'), ('ال','DET'), ('جو','NN'), ('روعه','JJ'), ('في','IN'), ('وجود','NN'), ('ك','PRP'), ('و','CC'), ('فلَه','JJ'), ('أنت','IN'), ('ه','PRP'), ('حضور','NN'), ('ك','PRP'), ('أيتميز','VB'), ('عن','IN'), ('ال','DET'), ('غير','NN'), ('وجود','NN'), ('ه','PRP'), ('صار','VB'), ('ضيقه','JJ'), ('و','CC'), ('علّه','JJ')]).

sentence([('@','REP'), ('sukainah__22','USERN'), ('اوكي','NN')]).

sentence([('@','REP'), ('fc_itt','USERN'), ('من','IN'), ('حق','NN'), ('كم','PRP'), ('اهل','NN'), ('ال','DET'), ('دار','NN')]).

sentence([('@','REP'), ('mr_abdualaziz1','USERN'), ('تطبيقا','NN'), ('ل','IN'), ('عدالة','NN'), ('بين','IN'), ('هم','PRP'), ('و','CC'), ('بين','IN'), ('ال','DET'), ('موظف','NN'), ('ين','AGR')]).

sentence([('@','REP'), ('altovan_mhrka','USERN'), ('حفظ','VB'), ('الله','NNP'), ('والد','NN'), ('ي','PRP'), ('خادم','JJ'), ('ال','DET'), ('حرم','NN'), ('ين','AGR'), ('في','IN'), ('حل','NN'), ('ه','PRP'), ('و','CC'), ('ت','TNS1'), ('رحال','NN'), ('ه','PRP')]).

sentence([('@','REP'), ('M_8884','USERN'), ('ه','PRP'), ('اسال','NN'), ('تعالى','VB'), ('بان','IN'), ('يمن','VB'), ('علي','IN'), ('ه','PRP'), ('ب','IN'), ('ال','DET'), ('صحة','NN'), ('و','CC'), ('ال','DET'), ('عافيه','NN'), ('و','CC'), ('ان','IN'), ('ي','TNS1'), ('كتب','VB'), ('له','PRP'), ('و','CC'), ('لكم','PRP'), ('جر','VB'), ('على','IN'), ('قدر','VB'), ('ما','WP'), ('كان','VB'), ('الب','NN'), ('على','IN'), ('قدر','VB'), ('ما','WP'), ('كان','VB'), ('جر','VB'), ('لعل','VB'), ('ها','PRP'), ('ان','IN'), ('شاء','VB'), ('الله','NNP'), ('تكفير','NN'), ('ذنوب','NN')]).

sentence([('ﻳ','TNS1'), ('ـﺎﺗـﻞ','NN'), ('ﻗـﻠـﺒ','NN'), ('ـﻲ','PRP'), ('ﺗـﻞ','VB'), ('ﺩﻟـﻮٍ','NN'), ('ﻋـﻠـﻰ','IN'), ('ﻧـﺎﻋـﻮﺭ','NN'), ('ﻳ','TNS1'), ('ـﺘـﻠ','VB'), ('ـﻪ','PRP'), ('ﻏـﺸـﻴـﻢٍ','JJ'), ('ﻣـﺎﺗـﻌـﻠـﻢ','NN'), ('ﻋـﻠـﻰ','IN'), ('ﺟـﺮﻩ','VB'), ('http://t.co/N5Un45lfon','LINK')]).

sentence([('@','REP'), ('TAB_KSA','USERN'), ('اقول','VB'), ('اخو','NN'), ('ي','PRP'), ('طارق','NNP'), ('سمع','VB'), ('ت','PRP'), ('اخر','JJ'), ('خبر','NN'), ('!','PUNC'), ('!','PUNC'), ('!','PUNC')]).

sentence([('ثلاث','CD'), ('ادعية','JJ'), ('لا','RP'), ('ت','TNS1'), ('نسا','VB'), ('ها','PRP'), ('في','IN'), ('سجود','RB'), ('ك','PRP'), ('اللهم','NN'), ('إن','IN'), ('ي','PRP'), ('اسال','VB'), ('ك','PRP'), ('حسن','NN'), ('ال','DET'), ('خاتمة','NN'), ('اللهم','NN'), ('ارزق','VB'), ('ني','PRP'), ('توبة','NN'), ('نصوحاً','JJ'), ('قبل','IN'), ('ال','DET'), ('موت','NN'), ('اللهم','NN'), ('يا','RP'), ('مقلب','NN'), ('ال','DET'), ('قلوب','NN'), ('ثبت','VB'), ('قلب','NN'), ('ي','PRP'), ('على','IN'), ('دين','NN'), ('ك','PRP')]).

sentence([('قل','VB'), ('هم','PRP'), ('لسه','NN'), ('واااااااااااااقف','JJ'), ('ييييييييييييين','AGR')]).

sentence([('@','REP'), ('MazenSoly','USERN'), ('مش','VB'), ('كل','NN'), ('ه','PRP'), ('ب','IN'), ('صراحة','NN'), ('كان','VB'), ('في','PRP'), ('ه','PRP'), ('حاج','NN'), ('ات','AGR'), ('نطعة','JJ'), (':-D','EMOT')]).

sentence([('I"m','VB'), ('at','IN'), ('Arab','NNP'), ('Bank','NN'), ('|','PUNC'), ('ال','DET'), ('بنك','NN'), ('ال',''), ('عربي','NN'), ('(','PUNC'), ('Amman','NNP'), (')','PUNC'), ('http://t.co/6yYXLDptsZ','LINK')]).

sentence([('ذهب','VB'), ('وا','AGR'), ('الى','IN'), ('مكة','NNP'), ('ل',''), ('أداء','NN'), ('ال','DET'), ('عمرة','NN'), ('اللهم','NN'), ('احفظ','VB'), ('هم','PRP'), ('و','CC'), ('يسر','VB'), ('لهم','PRP'), ('أمور','NN'), ('هم','PRP'), ('ورد','VB'), ('هم','PRP'), ('سالم','JJ'), ('ين','AGR'), ('غانم','JJ'), ('ين','AGR'), ('http://t.co/lf1cqO0d1r','LINK')]).

sentence([('ال','DET'), ('سبورت','NNP'), (':','PUNC'), ('6','CD'), ('لاعب','NN'), ('ين','AGR'), ('آخر','NN'), ('ين','AGR'), ('من','IN'), ('ال','DET'), ('متوقع','NN'), ('ان','IN'), ('ي','TNS1'), ('غادر','VB'), ('وا','AGR'), ('ال','DET'), ('فريق','NN'), ('هذا','DT'), ('ال','DET'), ('صيف','NN'), ('.','PUNC'), ('لا','RP'), ('ال','DET'), ('وصل','NN'), ('تـبـغـا','VB'), ('ه','PRP'), ('.','PUNC'), ('.','PUNC'), ('و','CC'), ('ما','WP'), ('ت','TNS1'), ('ـبـغى','VB'), ('الـجـفـا','NN'), ('كان','VB'), ('ما','WP'), ('ود','VB'), ('ك','PRP'), ('تـجـي','VB'), ('قـلـ','VB'), ('هـااااا','PRP'), ('و','CC'), ('(','PUNC'), ('أروح','VB'), (')','PUNC')]).

sentence([('جمال','NN'), ('ال','DET'), ('دنيا','NN'), ('ب','IN'), ('جمال','NN'), ('علاقت','NN'), ('ك','PRP'), ('مع','IN'), ('الله','NNP'), ('لا','RP'), ('سعيد','NNP'), ('إلا','RP'), ('مَن','IN'), ('أسعد','VB'), ('ه','PRP'), ('الله','NNP'), ('و','CC'), ('أعلم','VB'), ('أن','IN'), ('ه','PRP'), ('لو','IN'), ('أجتمع','VB'), ('ال','DET'), ('إنس','NN'), ('و','CC'), ('ال','DET'), ('جنّ','NN'), ('ل','IN'), ('ي','TNS1'), ('سعد','VB'), ('و','AGR'), ('ك','PRP'), ('لن','RP'), ('ي','TNS1'), ('سعد','VB'), ('و','AGR'), ('ك','PRP'), ('إلا','RP'), ('ب','IN'), ('إذن','NN'), ('الله','NNP')]).

sentence([('حسب','JJ'), ('ي','PRP'), ('الله','NNP'), ('على','IN'), ('كل','NN'), ('من','IN'), ('ساهم','VB'), ('أو','CC'), ('قتل','VB'), ('أو','CC'), ('تواطى','VB'), ('ال','DET'), ('صوره','NN'), ('ت','TNS1'), ('حكي','VB'), ('يا','PR'), ('ويل','VB'), ('كم','PRP'), ('من','IN'), ('الله','NNP'), ('@','REP'), ('n_q8_q8','USERN'), ('@','PUNC'), ('USERN','USERN'), ('@','PUNC'), ('USERN','USERN'), ('http://t.co/yWuqZBjHDc','LINK')]).

sentence([('@','REP'), ('Ayoo3k','USERN'), ('وي','UH'), ('وي','UH'), ('اح','NN'), ('اح','NN')]).

sentence([('رويترز','NNP'), (':','PUNC'), ('ال','DET'), ('عاهل','NN'), ('ال','DET'), ('سعودي','JJ'), ('ي','TNS1'), ('زور','VB'), ('ال','DET'), ('قاهرة','NNP'), ('و','CC'), ('يلتقي','VB'), ('ال','DET'), ('مشير','NN'), ('ال','DET'), ('سيسي','NNP'), ('.','PUNC')]).

sentence([('@','REP'), ('MISS_ALDAEHANI','USERN'), ('OK','JJ'), ('FF','NNP'), ('هههههههههههههههههه','UH')]).

sentence([('@','REP'), ('ZainKSA','USERN'), ('zaizafoon1400','NNP'), ('ال','DET'), ('سلام','NN'), ('علي','IN'), ('كم','PRP'), ('لا','PR'), ('ت','TNS1'), ('وجد','VB'), ('خدمه','NN'), ('منذو','NN'), ('يوم','NN'), ('ين','AGR'), ('و','CC'), ('ال','DET'), ('شبكه','NN'), ('عطلان','JJ'), ('ه','PRP')]).

sentence([('@','REP'), ('EssaBnM_','USERN'), ('ذبحححححححن','VB'), ('ي','PRP')]).

sentence([('عصريه','NN'), ('ممتعه','JJ'), ('ل','IN'), ('جميع','NN'), ('.','PUNC'), ('.','PUNC'), ('و','CC'), ('ويكند','NNP'), ('امتع','VB'), ('@','PUNC'), ('http://t.co/tjbmxgmKhl','LINK')]).

sentence([('تدور','VB'), ('سعادت','NN'), ('ي','PRP'), ('و','CC'), ('هي','PRP'), ('في','IN'), ('مبسم','NN'), ('ك','PRP'), ('،','PUNC'), ('انت','PRP'), ('بس','NN'), ('ابتسم','VB'), ('و','CC'), ('ي','TNS1'), ('بتسم','VB'), ('قلب','NN'), ('ي','PRP'), ('معا','NN'), ('ك','PRP')]).

sentence([('@','REP'), ('saimen5','USERN'), ('هههه','UH'), ('لا','RP'), ('اجيب','VB'), ('درجه','NN'), ('ان','IN'), ('ي','PRP'), ('هوايه','NN'), ('عند','NN'), ('ي','PRP'), ('سحيح','NN'), ('ات','AGR'), ('بس','NN'), ('عند','NN'), ('ي','PRP'), ('جم','NN'), ('اختيار','NN'), ('شاكه','VB'), ('بي','NN'), ('ه','PRP')]).

sentence([('@','REP'), ('othmanmali','USERN'), ('al','NNP'), ('manasa','NNP'), ('طيب','UH'), ('فتيحي','NNP'), ('لم','RP'), ('يوقع','VB'), ('و','CC'), ('هذا','DT'), ('حقيقه','NN'), ('بس','RP'), ('هنا','RB'), ('ك','PRP'), ('التزام','NN'), ('من','IN'), ('ال','DET'), ('لاعب','NN'), ('وكيل','NN'), ('ه','PRP'), ('و','CC'), ('ال','DET'), ('جمهور','NN'), ('ال','DET'), ('اتحاد','JJ'), ('ي','PRP'), ('فاهم','VB'), ('هالش','NN'), ('يعني','VB'), ('لا','PRP'), ('منصه','NN'), ('و','CC'), ('لا','RP'), ('اعلام','NN'), ('!','PUNC'), ('!','PUNC')]).

sentence([('إن','IN'), ('ت','TNS1'), ('حقق','VB'), ('ت','PRP'), ('أماني','NN'), ('نا','PRP'), ('(','PUNC'), ('فـ','CC'), ('ال','DET'), ('حمد','NN'), (')','PUNC'), ('،','PUNC'), ('و','CC'), ('إن','IN'), ('ت','TNS1'), ('أخر','VB'), ('ت','PRP'), ('ف','IN'), ('هي','PRP'), ('حتما','RB'), ('خيرا','NN'), ('لنا','PRP'), ('و','CC'), ('ي','TNS1'), ('بقى','VB'), ('ال','DET'), ('أمل','NN'), ('ب','IN'), ('الله','NNP'), ('ب','IN'), ('داخل','VB'), ('نا','PRP'), ('ي','TNS1'), ('وقض','VB'), ('كل','NN'), ('شي','NN'), ('(','PUNC'), ('جميل','JJ'), (')','PUNC'), ('ال','DET'), ('حمد','NN'), ('لله','NNP')]).

