SICStus 3.12.8 (i386-darwin-8.9.1): Tue May  8 13:13:57 CEST 2007
Licensed to man.ac.uk
| ?- % consulting /Library/WebServer/CGI-Executables/dgParser/setup.pl...
%  loading /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/charsio.po...
%  module charsio imported into user
%   loading foreign resource /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/i386-darwin-8.9.1/charsio.bundle in module charsio
%  loaded /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/charsio.po in module charsio, 0 msec 8512 bytes
% consulted /Library/WebServer/CGI-Executables/dgParser/setup.pl in module user, 0 msec 11448 bytes
yes
| ?- setup(allwords).
% compiling /Library/WebServer/CGI-Executables/dgParser/useful.pl...
%  loading /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/terms.po...
%  module terms imported into user
%   loading /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/assoc.po...
%   module assoc imported into terms
%    loading /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/lists.po...
%    module lists imported into assoc
%    loaded /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/lists.po in module lists, 0 msec 11328 bytes
%   loaded /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/assoc.po in module assoc, 0 msec 22728 bytes
%  loaded /usr/local/bin/sp-3.12.8/sicstus-3.12.8/library/terms.po in module terms, 0 msec 31128 bytes
% Undefined predicates will just fail (fail)
% compiled /Library/WebServer/CGI-Executables/dgParser/useful.pl in module user, 10 msec 58792 bytes
% compiling /Library/WebServer/CGI-Executables/dgParser/features.pl...
% compiled /Library/WebServer/CGI-Executables/dgParser/features.pl in module user, 20 msec 21620 bytes
% compiling /Library/WebServer/CGI-Executables/dgParser/pretty.pl...
% compiled /Library/WebServer/CGI-Executables/dgParser/pretty.pl in module user, 10 msec 12480 bytes
% compiling /Library/WebServer/CGI-Executables/dgParser/io.pl...
% compiled /Library/WebServer/CGI-Executables/dgParser/io.pl in module user, 0 msec 760 bytes
% compiling /Library/WebServer/CGI-Executables/dgParser/disjoin.pl...
% compiled /Library/WebServer/CGI-Executables/dgParser/disjoin.pl in module user, 10 msec 16720 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/signatures.pl...
* clauses for user:(signature/1) are not together
* Approximate lines: 5-64, file: '/Library/WebServer/CGI-Executables/dgParser/signatures.pl'
% consulted /Library/WebServer/CGI-Executables/dgParser/signatures.pl in module user, 0 msec 5272 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/agree.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/agree.pl in module user, 0 msec 8272 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/classes.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/classes.pl in module user, 40 msec 166040 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/negation.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/negation.pl in module user, 0 msec 1408 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/vforms.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/vforms.pl in module user, 10 msec 23320 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/pronouns.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/pronouns.pl in module user, 0 msec 3456 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/verbs.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/verbs.pl in module user, 0 msec 36464 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/mclasses.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/mclasses.pl in module user, 0 msec 1648 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/determiners.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/determiners.pl in module user, 10 msec 31224 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/nouns.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/nouns.pl in module user, 0 msec 2160 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/lookup.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/lookup.pl in module user, 0 msec 10008 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/chart.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/chart.pl in module user, 10 msec 64704 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/treepr.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/treepr.pl in module user, 10 msec 9520 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/conll.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/conll.pl in module user, 0 msec 7872 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/parseconstrained.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/parseconstrained.pl in module user, 0 msec 5344 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/preprocess.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/preprocess.pl in module user, 0 msec 12632 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/spelling.pl...
* abolish(user:(spellingRule/3)) - no matching predicate
* Approximate lines: 113-115, file: '/Library/WebServer/CGI-Executables/dgParser/spelling.pl'
% consulted /Library/WebServer/CGI-Executables/dgParser/spelling.pl in module user, 10 msec 12960 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/transformations.pl...
%  consulting /Library/WebServer/CGI-Executables/dgParser/setup.pl...
%  consulted /Library/WebServer/CGI-Executables/dgParser/setup.pl in module user, 0 msec -48 bytes
% consulted /Library/WebServer/CGI-Executables/dgParser/transformations.pl in module user, 0 msec 23152 bytes
% consulting /Library/WebServer/CGI-Executables/dgParser/allwords.pl...
%  including /Library/WebServer/CGI-Executables/dgParser/englishopen.pl...
%   including /Library/WebServer/CGI-Executables/dgParser/englishclosed.pl...
%    including /Library/WebServer/CGI-Executables/dgParser/englishaffixes.pl...
%    included /Library/WebServer/CGI-Executables/dgParser/englishaffixes.pl in module user, 0 msec 15104 bytes
%   included /Library/WebServer/CGI-Executables/dgParser/englishclosed.pl in module user, 40 msec 514696 bytes
%  included /Library/WebServer/CGI-Executables/dgParser/englishopen.pl in module user, 90 msec 986424 bytes
% consulted /Library/WebServer/CGI-Executables/dgParser/allwords.pl in module user, 9990 msec 94722904 bytes
yes
| ?- doItAll('I know John loves Mary .')

(i17
  + [(know> : verb),
     {(subject , spec(proRef,[I:pronoun]))},
     {(xcomp,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec(name,[John:name]))},
              {(dobj , spec(name,[Mary:name]))}]))}])
P = [(know>''):verb,{subject,spec(proRef,['I':pronoun])},{xcomp,spec(tense(present,-),[(love>s):verb,{subject,spec(name,['John':name])},{dobj,spec(...)}])}] ? 
yes
| ?- doItAll('I know John loves Mary .', X).
     .
no
| ?- doItAll('no man loves a woman .', X).

(i19
  + [(. : punct),
     {(claim,
        spec(tense(A, -),
             [(know> : verb),
              {(subject , spec(proRef,[I:pronoun]))},
              {(xcomp,
                 spec(tense(present, -),
                      [(love>s : verb),
                       {(subject , spec(name,[John:name]))},
                       {(dobj , spec(name,[Mary:name]))}]))}]))}])
the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((know>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((love>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
Trying to answer the(_561491::{salient([I:pronoun]),_561491},the(_562870::{named(John),_562870},the(_563176::{named(Mary),_563176},((know>):verb,[sk1])&((subject,_561491),[sk1])&((xcomp,(love>s):verb&(subject,_562870)&(dobj,_563176),[sk3]),[sk1]))))

No

Trying to answer the(_562870::{named(John),_562870},the(_563176::{named(Mary),_563176},((know>):verb,[sk1])&((subject,_561491),[sk1])&((xcomp,(love>s):verb&(subject,_562870)&(dobj,_563176),[sk3]),[sk1])))

No

Trying to answer the(_563176::{named(Mary),_563176},((know>):verb,[sk1])&((subject,_561491),[sk1])&((xcomp,(love>s):verb&(subject,_562870)&(dobj,_563176),[sk3]),[sk1]))

No

the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((know>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((love>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))


No

the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((believe>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((like>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
X = the(_A::{salient(['I':pronoun]),_A},the(_B::{named('John'),_B},the(_C::{named('Mary'),_C},((believe>''):verb,[sk1])&((subject,_A),[sk1])&((xcomp,(like>s):verb&(subject,_B)&(dobj,_C),[sk3]),[sk1])))) ? 
yes
| ?- doItAll('I doubt John knows Mary .', X).

(i20
  + [(. : punct),
     {(claim,
        spec(tense(A, -),
             [(believe> : verb),
              {(subject , spec(proRef,[I:pronoun]))},
              {(xcomp,
                 spec(tense(present, -),
                      [(know>s : verb),
                       {(subject , spec(name,[John:name]))},
                       {(dobj , spec(name,[Mary:name]))}]))}]))}])
the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((believe>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((know>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
Trying to answer the(_738751::{salient([I:pronoun]),_738751},the(_740130::{named(John),_740130},the(_740436::{named(Mary),_740436},((believe>):verb,[sk1])&((subject,_738751),[sk1])&((xcomp,(know>s):verb&(subject,_740130)&(dobj,_740436),[sk3]),[sk1]))))

No

Trying to answer the(_740130::{named(John),_740130},the(_740436::{named(Mary),_740436},((believe>):verb,[sk1])&((subject,_738751),[sk1])&((xcomp,(know>s):verb&(subject,_740130)&(dobj,_740436),[sk3]),[sk1])))

No

Trying to answer the(_740436::{named(Mary),_740436},((believe>):verb,[sk1])&((subject,_738751),[sk1])&((xcomp,(know>s):verb&(subject,_740130)&(dobj,_740436),[sk3]),[sk1]))

No

the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((believe>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((know>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
X = the(_A::{salient(['I':pronoun]),_A},the(_B::{named('John'),_B},the(_C::{named('Mary'),_C},((believe>''):verb,[sk1])&((subject,_A),[sk1])&((xcomp,(know>s):verb&(subject,_B)&(dobj,_C),[sk3]),[sk1])))) ? 
yes
| ?- parseOne('I doubt John knows Mary .', X).

(i20
  + [(. : punct),
     {(claim,
        spec(tense(A, -),
             [(doubt> : verb),
              {(subject , spec(proRef,[I:pronoun]))},
              {(xcomp,
                 spec(tense(present, -),
                      [(know>s : verb),
                       {(subject , spec(name,[John:name]))},
                       {(dobj , spec(name,[Mary:name]))}]))}]))}])
the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((doubt>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((know>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
Trying to answer the(_447468::{salient([I:pronoun]),_447468},the(_448847::{named(John),_448847},the(_449153::{named(Mary),_449153},((doubt>):verb,[sk1])&((subject,_447468),[sk1])&((xcomp,(know>s):verb&(subject,_448847)&(dobj,_449153),[sk3]),[sk1]))))

No

Trying to answer the(_448847::{named(John),_448847},the(_449153::{named(Mary),_449153},((doubt>):verb,[sk1])&((subject,_447468),[sk1])&((xcomp,(know>s):verb&(subject,_448847)&(dobj,_449153),[sk3]),[sk1])))

No

Trying to answer the(_449153::{named(Mary),_449153},((doubt>):verb,[sk1])&((subject,_447468),[sk1])&((xcomp,(know>s):verb&(subject,_448847)&(dobj,_449153),[sk3]),[sk1]))

No

the((A :: {salient([I:pronoun]),A}),
    the((B :: {named(John),B}),
        the((C :: {named(Mary),C}),
            (((doubt>):verb , [sk1])
              & ((subject,A , [sk1])
                  & ((xcomp,
                      (((know>s):verb & (subject,B)&(dobj,C)),
                       [sk3])),
                     [sk1]))))))
X = the(_A::{salient(['I':pronoun]),_A},the(_B::{named('John'),_B},the(_C::{named('Mary'),_C},((doubt>''):verb,[sk1])&((subject,_A),[sk1])&((xcomp,(know>s):verb&(subject,_B)&(dobj,_C),[sk3]),[sk1])))) ? 
yes
| ?- parseOne('every man loves a woman .', X).

(i20
  + [(. : punct),
     {(claim,
        spec(tense(A, -),
             [(doubt> : verb),
              {(subject , spec(proRef,[I:pronoun]))},
              {(xcomp,
                 pol(-, spec(tense(present, -),
                      [(know>s : verb),
                       {(subject , spec(name,[John:name]))},
                       {(dobj , spec(name,[Mary:name]))}]))}]))}])
X = ['.':punct,{claim,spec(tense(_A,-),[(doubt>''):verb,{subject,spec(proRef,['I':pronoun])},{xcomp,spec(tense(...),[(know>s):verb|...])}])}] ? 
yes
| ?- parseOne('every man loves a woman .', X).

(i12
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec([every:A],[(pol(-, (man>)):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
X = ['.':punct,{claim,spec(tense(present,-),[(love>s):verb,{subject,spec([every:_A],[(man>''):noun])},{dobj,spec([a:_B],[(woman>''):noun])}])}] ? 
yes
| ?- parseOne('no man loves a woman .', X).
     .

(i12
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec([no:A],[(man>):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
X = ['.':punct,{claim,spec(tense(present,-),[(love>s):verb,{subject,spec([no:_A],[(man>''):noun])},{dobj,spec([a:_B],[(woman>''):noun])}])}] ? 
yes
| ?- parseOne('every man not loves a woman .', X).

(i12
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec([no:A],[(man>):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
X = ['.':punct,{claim,spec(tense(present,-),[(love>s):verb,{subject,spec([no:_A],[(man>''):noun])},{dobj,spec([a:_B],[(woman>''):noun])}])}] ? 
yes
| ?- parseOne('evry man not loves a woman .', X).
! 'No such word'(evry)
| ?- parseOne('every man not loves a woman .', X).

(i15
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(modifier(negation,+) , [not:negationMarker])},
              {(subject , spec([every:A],[(man>):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
X = ['.':punct,{claim,spec(tense(present,-),[(love>s):verb,{modifier(negation,+),[not:negationMarker]},{subject,spec([every:_A],[(man>''):noun])},{dobj,spec(...)}])}] ? 
yes
| ?- % consulting /Library/WebServer/CGI-Executables/dgParser/transformations.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/transformations.pl in module user, 10 msec 2408 bytes
yes
| ?- doItAll('no man loves a woman .', X).

(i12
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec([no:A],[(man>):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
(((woman>):noun , [sk0])
  & all(A,
        (((man>):noun , A)
          => not((((love>s : verb)
                    & (subject,A & dobj,[sk0])),
                  [sk2])))))
(((woman>):noun , [sk0])
  & all(A,
        (((man>):noun , A)
          => not((((love>s : verb)
                    & (subject,A & dobj,[sk0])),
                  [sk2])))))
X = ((woman>''):noun,[sk0])&all(_A,((man>''):noun,_A)=>not(((love>s):verb&(subject,_A)&(dobj,[sk0]),[sk2]))) ? 
yes
| ?- % consulting /Library/WebServer/CGI-Executables/dgParser/transformations.pl...
% consulted /Library/WebServer/CGI-Executables/dgParser/transformations.pl in module user, 0 msec -80 bytes
yes
| ?- doItAll('there is a woman: no man loves her .', X).

(i12
  + [(. : punct),
     {(claim,
        spec(tense(present, -),
             [(love>s : verb),
              {(subject , spec([no:A],[(man>):noun]))},
              {(dobj , spec([a:B],[(woman>):noun]))}]))}])
(((woman>):noun , [sk0])
  & (((man>):noun , A)
      => (((at , [sk1],[sk2])
            & (((love>s):verb , [sk2])
                & ((subject,A),[sk2] & (dobj,[sk0]),[sk2])))
           => absurd)))
(((woman>):noun , [sk0])
  & (((man>):noun , A)
      => (((at , [sk1],[sk2])
            & (((love>s):verb , [sk2])
                & ((subject,A),[sk2] & (dobj,[sk0]),[sk2])))
           => absurd)))
X = ((woman>''):noun,[sk0])&((man>''):noun,_A)=>(((at,[sk1],[sk2])&((love>s):verb,[sk2])&((subject,_A),[sk2])&((dobj,[sk0]),[sk2]))=>absurd) ? 
yes
| ?- 
